; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   black_block_1 black_block_2 brown_block_2 brown_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (seen_psi_1) (hold_2))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (and (clear black_block_2) (not (= ?obj black_block_2))) (seen_psi_1)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (not (and (clear black_block_2) (not (= ?obj black_block_2)))) (hold_0)) (when (or (on brown_block_1 brown_block_2) (and (clear black_block_1) (not (= ?obj black_block_1)))) (seen_psi_1)) (when (and (or (= ?obj brown_block_2) (holding brown_block_2)) (not (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (hold_2)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (= ?obj black_block_2) (clear black_block_2) (seen_psi_1)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (not (or (= ?obj black_block_2) (clear black_block_2))) (hold_0)) (when (or (on brown_block_1 brown_block_2) (= ?obj black_block_1) (clear black_block_1)) (seen_psi_1)) (when (and (holding brown_block_2) (not (= ?obj brown_block_2)) (not (or (= ?obj brown_block_1) (clear brown_block_1)))) (hold_2)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj) (or (= ?obj black_block_2) (and (clear black_block_2) (not (= ?underobj black_block_2))) (seen_psi_1)))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (not (or (= ?obj black_block_2) (and (clear black_block_2) (not (= ?underobj black_block_2))))) (hold_0)) (when (or (and (= ?obj brown_block_1) (= ?underobj brown_block_2)) (on brown_block_1 brown_block_2) (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1)))) (seen_psi_1)) (when (and (holding brown_block_2) (not (= ?obj brown_block_2)) (not (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1)))))) (hold_2)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty) (or (= ?underobj black_block_2) (and (clear black_block_2) (not (= ?obj black_block_2))) (seen_psi_1)))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (not (or (= ?underobj black_block_2) (and (clear black_block_2) (not (= ?obj black_block_2))))) (hold_0)) (when (or (and (on brown_block_1 brown_block_2) (not (and (= ?obj brown_block_1) (= ?underobj brown_block_2)))) (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1)))) (seen_psi_1)) (when (and (or (= ?obj brown_block_2) (holding brown_block_2)) (not (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1)))))) (hold_2)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   orange_block_1 - block
 )
 (:init (ontable black_block_1) (ontable brown_block_1) (on brown_block_2 black_block_1) (ontable orange_block_1) (on black_block_2 orange_block_1) (clear brown_block_1) (clear brown_block_2) (clear black_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (clear orange_block_1) (hold_0) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack brown_block_2 black_block_1)
   deleted: (on brown_block_2 black_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear black_block_1) (seen_psi_1)
   goals met: 0 of 3
2. (putdown brown_block_2)
   deleted: (holding brown_block_2)
   added: (clear brown_block_2) (handempty) (ontable brown_block_2)
   goals met: 0 of 3
3. (unstack black_block_2 orange_block_1)
   deleted: (on black_block_2 orange_block_1) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear orange_block_1) (hold_0)
   goals met: 2 of 3
4. (stack black_block_2 brown_block_1)
   deleted: (clear brown_block_1) (holding black_block_2)
   added: (handempty) (clear black_block_2) (on black_block_2 brown_block_1)
   goals met: 2 of 3
5. (pickup brown_block_2)
   deleted: (clear brown_block_2) (ontable brown_block_2) (handempty)
   added: (holding brown_block_2) (hold_2)
   goals met: 3 of 3
